In [1]:
import numpy as np
import pandas as pd

In [2]:
# Series : numpy 의 1차원 배열과 비슷
obj = pd.Series([4,7,-5,3])

In [3]:
# obj 의 Value
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj.dtypes

dtype('int64')

In [6]:
# Series에 index 적용
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
# dictionary의 data를 Series로
sData = {'Charles':10000,'Kenny':20000,'Henry':30000}
obj3 = pd.Series(sData)
obj3

Charles    10000
Kenny      20000
Henry      30000
dtype: int64

In [8]:
obj3.name = 'Salary' #data 이름을 설정
obj3.index.name = 'name' # index 이름을 지정
obj3

name
Charles    10000
Kenny      20000
Henry      30000
Name: Salary, dtype: int64

In [9]:
# index 변경
obj3.index = ['A', 'B', 'C']
obj3

A    10000
B    20000
C    30000
Name: Salary, dtype: int64

# DataFrame

In [10]:
# 딕셔너리로 data frame 생성
data = {
    'names' :['kenny','kenny','kenny','charles','charles'],
    'year' : [2016, 2017, 2018, 2016, 2017],
    'points' : [1.5, 1.7, 3.6, 2.4, 2.9]
}
df = pd.DataFrame(data)
df

     names  year  points
0    kenny  2016     1.5
1    kenny  2017     1.7
2    kenny  2018     3.6
3  charles  2016     2.4
4  charles  2017     2.9

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.values

array([['kenny', 2016, 1.5],
       ['kenny', 2017, 1.7],
       ['kenny', 2018, 3.6],
       ['charles', 2016, 2.4],
       ['charles', 2017, 2.9]], dtype=object)

In [13]:
df.columns # value보다 column이 더 중요함

Index(['names', 'year', 'points'], dtype='object')

In [14]:
df.index.name = 'Num'
df.columns.name = 'Info'
df

Info    names  year  points
Num
0       kenny  2016     1.5
1       kenny  2017     1.7
2       kenny  2018     3.6
3     charles  2016     2.4
4     charles  2017     2.9

In [15]:
df2 = pd.DataFrame(data, columns = ['year', 'names', 'points', 'penalty'],
index = ['one', 'two', 'three', 'four', 'five'])
df2

       year    names  points penalty
one    2016    kenny     1.5     NaN
two    2017    kenny     1.7     NaN
three  2018    kenny     3.6     NaN
four   2016  charles     2.4     NaN
five   2017  charles     2.9     NaN

In [16]:
df2.values

array([[2016, 'kenny', 1.5, nan],
       [2017, 'kenny', 1.7, nan],
       [2018, 'kenny', 3.6, nan],
       [2016, 'charles', 2.4, nan],
       [2017, 'charles', 2.9, nan]], dtype=object)

In [17]:
# 통계의 기초 통계량을 확인
df2.describe() # std = 표준편차(평균과의 차이값들의 평균) , 예측률, 오차범위, 신빙성 표준편차는 작을수록 좋음

             year    points
count     5.00000  5.000000
mean   2016.80000  2.420000
std       0.83666  0.864292
min    2016.00000  1.500000
25%    2016.00000  1.700000
50%    2017.00000  2.400000
75%    2017.00000  2.900000
max    2018.00000  3.600000

In [18]:
df2

       year    names  points penalty
one    2016    kenny     1.5     NaN
two    2017    kenny     1.7     NaN
three  2018    kenny     3.6     NaN
four   2016  charles     2.4     NaN
five   2017  charles     2.9     NaN

In [19]:
df2['penalty'] = 0.5
df2

       year    names  points  penalty
one    2016    kenny     1.5      0.5
two    2017    kenny     1.7      0.5
three  2018    kenny     3.6      0.5
four   2016  charles     2.4      0.5
five   2017  charles     2.9      0.5

In [20]:
df2['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5]
df2

       year    names  points  penalty
one    2016    kenny     1.5      0.1
two    2017    kenny     1.7      0.2
three  2018    kenny     3.6      0.3
four   2016  charles     2.4      0.4
five   2017  charles     2.9      0.5

In [21]:
df2['zeros'] = np.arange(5)
df2

       year    names  points  penalty  zeros
one    2016    kenny     1.5      0.1      0
two    2017    kenny     1.7      0.2      1
three  2018    kenny     3.6      0.3      2
four   2016  charles     2.4      0.4      3
five   2017  charles     2.9      0.5      4

In [22]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [23]:
# Series를 dataframe에 넣기
df2['debt'] = val
df2

       year    names  points  penalty  zeros  debt
one    2016    kenny     1.5      0.1      0   NaN
two    2017    kenny     1.7      0.2      1  -1.2
three  2018    kenny     3.6      0.3      2   NaN
four   2016  charles     2.4      0.4      3  -1.5
five   2017  charles     2.9      0.5      4  -1.7

In [24]:
df2['net_points'] = df2['points']-df2['penalty']
df2

       year    names  points  penalty  zeros  debt  net_points
one    2016    kenny     1.5      0.1      0   NaN         1.4
two    2017    kenny     1.7      0.2      1  -1.2         1.5
three  2018    kenny     3.6      0.3      2   NaN         3.3
four   2016  charles     2.4      0.4      3  -1.5         2.0
five   2017  charles     2.9      0.5      4  -1.7         2.4

In [25]:
df2['high_points'] = df2['net_points'] > 2
df2

       year    names  points  penalty  zeros  debt  net_points  high_points
one    2016    kenny     1.5      0.1      0   NaN         1.4        False
two    2017    kenny     1.7      0.2      1  -1.2         1.5        False
three  2018    kenny     3.6      0.3      2   NaN         3.3         True
four   2016  charles     2.4      0.4      3  -1.5         2.0        False
five   2017  charles     2.9      0.5      4  -1.7         2.4         True

In [26]:
del df2['high_points']
del df2['net_points']
del df2['zeros']
df2

       year    names  points  penalty  debt
one    2016    kenny     1.5      0.1   NaN
two    2017    kenny     1.7      0.2  -1.2
three  2018    kenny     3.6      0.3   NaN
four   2016  charles     2.4      0.4  -1.5
five   2017  charles     2.9      0.5  -1.7

In [27]:
df2.loc['two':'four',['points','penalty']]

       points  penalty
two       1.7      0.2
three     3.6      0.3
four      2.4      0.4

In [28]:
df2.loc['six',:] = [2018, 'henry', 4.0, 0.1, 2.1]
df2

         year    names  points  penalty  debt
one    2016.0    kenny     1.5      0.1   NaN
two    2017.0    kenny     1.7      0.2  -1.2
three  2018.0    kenny     3.6      0.3   NaN
four   2016.0  charles     2.4      0.4  -1.5
five   2017.0  charles     2.9      0.5  -1.7
six    2018.0    henry     4.0      0.1   2.1

In [29]:
# iloc
df = df2

In [30]:
df.iloc[3]

year          2016
names      charles
points         2.4
penalty        0.4
debt          -1.5
Name: four, dtype: object

In [31]:
df.iloc[3:5]

        year    names  points  penalty  debt
four  2016.0  charles     2.4      0.4  -1.5
five  2017.0  charles     2.9      0.5  -1.7

In [32]:
df.iloc[[0,1,3],[1,2]]

        names  points
one     kenny     1.5
two     kenny     1.7
four  charles     2.4

In [33]:
# loc를 사용하여 year가 2016보다 큰 데이터 전체 추출
df[df.loc[:,'year']>2016]

         year    names  points  penalty  debt
two    2017.0    kenny     1.7      0.2  -1.2
three  2018.0    kenny     3.6      0.3   NaN
five   2017.0  charles     2.9      0.5  -1.7
six    2018.0    henry     4.0      0.1   2.1

In [34]:
#loc를 사용하여 names가 kenny인 정보중 names와 point만 추출하기
kenny = df.loc[:,'names']=='kenny'
df.loc[kenny,['names','points']]

       names  points
one    kenny     1.5
two    kenny     1.7
three  kenny     3.6

In [35]:
kenny

one       True
two       True
three     True
four     False
five     False
six      False
Name: names, dtype: bool